----------------------------------------------------------------------------
-- Позиция и смещение прикрепляемых моделей к костям педов
-- 1 - голова
-- 11 - левая рука
-- 12 - правая рука
ARR.boneAttachmentOffsets = {
	-- Если больше			назад	влево	вниз
	--				scale, 	x, 		y, 		z, 		rx,		ry, 	rz
	["5844"] = {															-- Хлеб
		["12"] = {  0.75,	0.02,	0.08,	-0.02,	0,		0,		0	}
	};
	["5375"] = {															-- Пучок пшеницы
		["12"] = {  1.0,	0.0,	0.03,	0.07,	0,		-90,	0	}
	};	
	["5373"] = {															-- Серп
		["12"] = { 	1.0,	-0.18,	0.03,	0.1,	-90,	0,		0 	}
	};
	["5374"] = {															-- Яблоко
		["12"] = { 	1.0,	-0.035,	0.06,	0.08,	0,		0,		0 	}
	};
}