--[[
	Синхронизирует матрицу камеры игроков
--]]
--------------------------------------------------------------------------------
--<[ Внутренние события ]>------------------------------------------------------
--------------------------------------------------------------------------------
addEvent( "Camera.onClientSync", true )											-- Клиент прислал данные о матрице своей камеры ( string cameraMatrixData )

--------------------------------------------------------------------------------
--<[ Модуль Camera ]>-----------------------------------------------------------
--------------------------------------------------------------------------------
Camera = {
	init = function()
		addEventHandler( "Camera.onClientSync", resourceRoot, Camera.onClientSync )
	end;
	
	----------------------------------------------------------------------------
	--<[ Обработчики событий ]>-------------------------------------------------
	----------------------------------------------------------------------------

	-- Клиент прислал данные о матрице своей камеры
	onClientSync = function( cameraMatrixData )
		-- TODO валидация данных "x|y|z|vx|vy|vz"
		setElementData( client, "_cm", cameraMatrixData )
	end;
};
addEventHandler( "onResourceStart", resourceRoot, Camera.init )